In [10]:
import pandas as pd

In [11]:
df = pd.read_csv("Resource/application_record.csv")
df.head(100)

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
1,5008805,M,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
2,5008806,M,Y,Y,112500.0,Working,Secondary / secondary special,Married,House / apartment,2
3,5008808,F,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single,House / apartment,1
4,5008809,F,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single,House / apartment,1
...,...,...,...,...,...,...,...,...,...,...
95,5008905,F,N,Y,297000.0,Commercial associate,Secondary / secondary special,Single,Rented apartment,1
96,5008906,F,N,Y,297000.0,Commercial associate,Secondary / secondary special,Single,Rented apartment,1
97,5008907,F,N,Y,297000.0,Commercial associate,Secondary / secondary special,Single,Rented apartment,1
98,5008908,F,N,Y,297000.0,Commercial associate,Secondary / secondary special,Single,Rented apartment,1
99,5008909,F,N,Y,297000.0,Commercial associate,Secondary / secondary special,Single,Rented apartment,1

In [16]:
df2 = df.rename(columns={'CODE_GENDER': 'GENDER', 
                   'FLAG_OWN_CAR': 'CAR',
                   'FLAG_OWN_REALTY': 'HOUSE',
                   'AMT_INCOME_TOTAL': 'TOTAL INCOME',
                   'NAME_INCOME_TYPE': 'INCOME CATEGORY',
                   'NAME_EDUCATION_TYPE': 'EDUCATION LEVEL',
                   'NAME_FAMILY_STATUS': 'MARITAL STATUS',
                   'NAME_HOUSING_TYPE': 'WAY OF LIVING',
                   'CNT_FAM_MEMBERS': 'FAMILY SIZE'})

In [17]:
df2.head()

,ID,GENDER,CAR,HOUSE,TOTAL INCOME,INCOME CATEGORY,EDUCATION LEVEL,MARITAL STATUS,WAY OF LIVING,FAMILY SIZE
0,5008804,M,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
1,5008805,M,Y,Y,427500.0,Working,Higher education,Civil marriage,Rented apartment,2
2,5008806,M,Y,Y,112500.0,Working,Secondary / secondary special,Married,House / apartment,2
3,5008808,F,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single,House / apartment,1
4,5008809,F,N,Y,270000.0,Commercial associate,Secondary / secondary special,Single,House / apartment,1

In [18]:
df2.to_csv('clean_data.csv', index=False)